IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-A PIC 9 VALUE 0.
    01 i PIC 9(4).
    01 j PIC 9(4).
    01 userInput PIC 9(4).
    01 t1 PIC 9(4) VALUE 0.
    01 t2 PIC 9(4) VALUE 1.
    01 nextTerm PIC 9(4).
    01 fibonacciSeries OCCURS 100 TIMES PIC 9(4).

PROCEDURE DIVISION.
    DISPLAY "Enter the number of terms: ".
    ACCEPT userInput.
    
    MOVE t1 TO fibonacciSeries(1).
    MOVE t2 TO fibonacciSeries(2).
    
    PERFORM VARYING i FROM 3 BY 1 UNTIL i > userInput
        COMPUTE nextTerm = t1 + t2
        MOVE nextTerm TO fibonacciSeries(i)
        MOVE t2 TO t1
        MOVE nextTerm TO t2
    END-PERFORM.
    
    DISPLAY "Fibonacci Series: ".
    PERFORM VARYING j FROM 1 BY 1 UNTIL j > userInput
        DISPLAY fibonacciSeries(j) SPACE
    END-PERFORM.
STOP RUN.
    